app/Controllers/Students.php

    public function update($id = null)
    {
        $data = $this->request->getRawInput();

        // students table
        $model = new StudentsModel();
        $user = $model->find($id);

		if ( !$user ) {
			return $this->failNotFound('Student not found (id:'.$id.')');
		}

        $_newData = array();
        $_newData['academies_users_id'] = $data['academies_users_id'];
        $_newData['companies_users_id'] = $data['companies_users_id'];
        $_newData['courses_id'] = $data['courses_id'];

        if( !$model->update($id, $_newData) ){
            die( print_r($model->errors()) );
        }
        unset($_newData);


        // users table
        $users_id = $user['users_id'];
        $model = new UsersModel();

        $user = $model->find($users_id);
---
SELECT *
FROM `students`
WHERE `students`.`deleted_at` IS NULL
AND `students`.`id` = '5'
UPDATE `students` SET `academies_users_id` = '4', `companies_users_id` = '2', `courses_id` = '4'
WHERE `students`.`id` IN ('5')
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '20'

            unset($data['email']);
        }

        if( !$model->update($users_id, $data) ){
---
UPDATE `users` SET `name` = 'Nombre estudiante33wer23r23r23', `surname` = 'Apellidos estudiante33', `address` = 'C/ de estudiante33', `post_code` = '78945', `birthdate` = '2000-01-13', `dni` = '33333333H', `phone` = '333333333'
WHERE `users`.`id` IN ('20')