app/Models/AcademyTutorModel.php

    public function getTeachers() {

        $builder = $this->table('academies_users');
        $builder->select(''
            .'academies_users.*'
            .','.$this->fieldsToString('users_fields','users','user')."\n" //student user data
            .',languages.name as languages_name, countries.name as countries_name'."\n"
        );
        $builder->join('users', 'academies_users.users_id = users.id');
        $builder->join('languages', 'users.languages_id = languages.id');
        $builder->join('countries', 'users.countries_id = countries.id');
        $builder->where('profiles_id', 15);


        return $builder->findAll();
---
SELECT `academies_users`.*, `users`.`id` as `user_id`, `users`.`email` as `user_email`, `users`.`password` as `user_password`, `users`.`name` as `user_name`, `users`.`dni` as `user_dni`, `users`.`birthdate` as `user_birthdate`, `users`.`surname` as `user_surname`, `users`.`phone` as `user_phone`, `users`.`address` as `user_address`, `users`.`post_code` as `user_post_code`, `users`.`languages_id` as `user_languages_id`, `users`.`countries_id` as `user_countries_id`, `users`.`metadata` as `user_metadata`, `languages`.`name` as `languages_name`, `countries`.`name` as `countries_name`
FROM `academies_users`
JOIN `users` ON `academies_users`.`users_id` = `users`.`id`
JOIN `languages` ON `users`.`languages_id` = `languages`.`id`
JOIN `countries` ON `users`.`countries_id` = `countries`.`id`
WHERE `profiles_id` = 15
AND `academies_users`.`deleted_at` IS NULL