app/Models/CompaniesModel.php

    public function getAll()
    {

        $builder = $this->table('companies');
        $builder->select('*');
        return $builder->findAll();
---
SELECT *
FROM `companies`
WHERE `companies`.`deleted_at` IS NULL

    public function getAcademyUsers()
    {

        $builder = $this->table('companies');
        $builder->select('companies_users.*'
            .','.$this->fieldsToString('users_fields','users','user')."\n" //student user data
//            .',languages.name as languages_name, countries.name as countries_name'."\n"
        );
        $builder->join('companies_users', 'companies.id = companies_users.companies_id');
        $builder->join('users', 'companies_users.users_id = users.id');
        return $builder->findAll();
---
SELECT `companies_users`.*, `users`.`id` as `user_id`, `users`.`email` as `user_email`, `users`.`password` as `user_password`, `users`.`name` as `user_name`, `users`.`dni` as `user_dni`, `users`.`birthdate` as `user_birthdate`, `users`.`surname` as `user_surname`, `users`.`phone` as `user_phone`, `users`.`address` as `user_address`, `users`.`post_code` as `user_post_code`, `users`.`languages_id` as `user_languages_id`, `users`.`countries_id` as `user_countries_id`, `users`.`metadata` as `user_metadata`
FROM `companies`
JOIN `companies_users` ON `companies`.`id` = `companies_users`.`companies_id`
JOIN `users` ON `companies_users`.`users_id` = `users`.`id`
WHERE `companies`.`deleted_at` IS NULL