app/Models/CoursesModel.php

SELECT *
FROM `courses`
ORDER BY `acronym` ASC
---
    public function getAll() {
        $builder = $this->table('courses');
        $builder->orderBy('acronym', 'ASC');

        return $builder->findAll();