app/Models/CoursesHoursModel.php

    public function getHoursForStudenAndCourses($students_id, $courses_id) {

        $builder = $this->table('courses_hours');
        $builder->select('report_types_id, hours as course_hours');
        $builder->where('students_id', $students_id);
        $builder->where('courses_id', $courses_id);

        return $builder->findAll();
---
SELECT `report_types_id`, `hours` as `course_hours`
FROM `courses_hours`
WHERE `students_id` = '1'
AND `courses_id` = '1'