app/Models/ReportsModel.php

SELECT `report_types_id`, `report_types`.`name` as `report_types_name`, SUM(hours_total) as hours_total
FROM `reports_daily`
JOIN `report_types` ON `reports_daily`.`report_types_id` = `report_types`.`id`
WHERE `students_id` = '1'
GROUP BY `report_types_id`
---
    public function getTotalHoursByType($student_id)
    {

        $builder = $this->table('reports_daily');
        $builder->select('report_types_id, report_types.name as report_types_name, SUM(hours_total) as hours_total');
        $builder->join('report_types', 'reports_daily.report_types_id = report_types.id');
        $builder->groupBy('report_types_id');
        $builder->where('students_id', $student_id);
        return $builder->findAll();